9/data/attachments/871923055d2d20af.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Haley_myself_Friend_25879_6</nif:username>
            <nif:friendToBeRequested>soap_friends_ab958f1b-5b02-4dd2-8fc6-421991f2fb8a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>